read_verilog top.v
prep -top top
write_smt2 -bv top.smt2